# Handling Missing Data

In [29]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0] = None

string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [4]:
data1 = pd.Series([np.nan, 'aardvark', 'artichoke', np.nan, 'avocado', 'banana', np.nan])
# data1.dropna()

In [5]:
data1[0] = 'orange'
data1.fillna(method='ffill') # left as NaN if at the bigening of series or col
# data1.fillna(method='bfill') # left as NaN if at the end of series or col
# print(data1)
# data1

0       orange
1     aardvark
2    artichoke
3    artichoke
4      avocado
5       banana
6       banana
dtype: object

In [6]:
from numpy import nan as NA

In [7]:
data2 = pd.Series([1, NA, 3.5, NA, 7])
data2.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data2[data2.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data3 = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data3

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
# cleaned = data3.dropna()
cleaned = data3.dropna(how='all')
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data3[3] = NA
# data3
data3.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.490926       NaN       NaN
1  0.302248       NaN       NaN
2  0.296166       NaN -0.110396
3 -1.246955       NaN  0.743544
4 -0.982812 -0.211467  0.209205
5  0.881283 -0.742636 -0.226262
6 -0.378423 -0.900353 -0.249164

In [13]:
# df.dropna()
df.dropna(thresh=2)

          0         1         2
2  0.296166       NaN -0.110396
3 -1.246955       NaN  0.743544
4 -0.982812 -0.211467  0.209205
5  0.881283 -0.742636 -0.226262
6 -0.378423 -0.900353 -0.249164

# Filling In Missing Data

In [14]:
# df.fillna(0)
# df.fillna({1 : 0.5, 2 : 0.2})
df.fillna(0, inplace=False)

          0         1         2
0 -0.490926  0.000000  0.000000
1  0.302248  0.000000  0.000000
2  0.296166  0.000000 -0.110396
3 -1.246955  0.000000  0.743544
4 -0.982812 -0.211467  0.209205
5  0.881283 -0.742636 -0.226262
6 -0.378423 -0.900353 -0.249164

In [15]:
df1 = pd.DataFrame(np.random.randn(6, 3))

In [16]:
df1.iloc[2:, 1] = NA
df1.iloc[4:, 2] = NA
df1

          0         1         2
0  0.167001  1.017171 -1.394147
1  2.103784 -0.192658  0.146391
2 -0.501749       NaN -0.955245
3 -0.358104       NaN -0.385960
4 -0.678511       NaN       NaN
5 -1.505956       NaN       NaN

In [17]:
# df1.fillna(method='ffill')
df1.fillna(method='ffill', limit=2)

          0         1         2
0  0.167001  1.017171 -1.394147
1  2.103784 -0.192658  0.146391
2 -0.501749 -0.192658 -0.955245
3 -0.358104 -0.192658 -0.385960
4 -0.678511       NaN -0.385960
5 -1.505956       NaN -0.385960

In [18]:
data3 = pd.Series([1., NA, 3.5, NA, 7])
data3.fillna(data3.mean(), inplace=True)
data3

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [19]:
data3.fillna(0, axis=0)

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

## Removing Duplicates

In [20]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [21]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [22]:
# data.duplicated()
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [23]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [24]:
# data.drop_duplicates('k1')
# data.drop_duplicates('k2')
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# Transforming Data Using a Function or Mapping

In [25]:
data4 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
# data4

# mapper dictionary
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}
# meat_to_animal

#### mapping values

In [26]:
lower_cased = data4['food'].str.lower()
data4
data4['animal'] = lower_cased.map(meat_to_animal)
data4

# same thing can be done with lambda fn
# data4['animal'] = data4['food'].map(lambda x: meat_to_animal[x.lower()])
# data4

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

# Replacing Values

In [27]:
data5 = pd.Series([1., -999., 2., -999., -1000., 3.])
# data5.replace(-999, np.nan) # for a single kind of values
# data5.replace([-999, -1000], np.nan) # for a multiple kind of value at once
# data5.replace([-999, -1000], [np.nan, 1]) # for substituting multiple values with multiple substituents
data5.replace({-999:np.nan, -1000:0}) # for substituting multiple values with multiple substituents

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indexes

In [28]:
data6 = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])
data6

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [29]:
T_fn = lambda x: x[:4].upper()   # Transformer function

In [30]:
# data6.index.map(T_fn)
data6.index = data6.index.map(T_fn)
data6

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

#### raname()

In [31]:
renamed_data = data6.rename(index = str.title, columns=str.upper)
# renamed_data  # orignal data is not modified
# renamed_data.columns
renamed_data.index

Index(['Ohio', 'Colo', 'New '], dtype='object')

In [32]:
data6.rename(index={"OHIO":"PAKISTAN"}, columns={"two":"ASIA"}, inplace=False)
data6

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

# Discretization and Binning

In [33]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [34]:
cats.codes
cats.categories
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [35]:
 pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [36]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [37]:
data = np.random.rand(20)
pd.cut(data, 4, precision=True)

[(0.2, 0.5], (0.2, 0.5], (0.01, 0.2], (0.01, 0.2], (0.5, 0.7], ..., (0.2, 0.5], (0.5, 0.7], (0.7, 1.0], (0.01, 0.2], (0.5, 0.7]]
Length: 20
Categories (4, interval[float64]): [(0.01, 0.2] < (0.2, 0.5] < (0.5, 0.7] < (0.7, 1.0]]

#### qcut()

In [38]:
data = np.random.rand(1500)

In [39]:
cats = pd.qcut(data, 4)
cats
pd.value_counts(cats)

(0.759, 0.999]        375
(0.508, 0.759]        375
(0.237, 0.508]        375
(-0.000632, 0.237]    375
dtype: int64

In [40]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
pd.value_counts(cats)

(0.759, 0.999]        375
(0.508, 0.759]        375
(0.237, 0.508]        375
(-0.000632, 0.237]    375
dtype: int64

# Detecting and Filtering Outliers

In [41]:
data_df = pd.DataFrame(np.random.randn(1000, 4))
data_df

            0         1         2         3
0   -0.480002  1.369333  0.004368 -0.164892
1   -1.587086 -0.998372 -0.073951  1.019222
2   -1.363614 -1.586745 -0.380710 -0.440659
3   -0.779031  0.518453 -1.632162 -2.069430
4   -0.490550 -0.408479  0.893696 -0.040337
..        ...       ...       ...       ...
995  0.228208  1.891174  1.029616 -2.709806
996 -2.389073  0.825720 -0.418393 -1.538917
997  1.016139  0.834693  0.899585 -0.201792
998 -0.170731 -0.460044 -0.170451 -0.410750
999 -0.792721 -0.003875 -0.262861  0.869106

[1000 rows x 4 columns]

In [42]:
data_df.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.036982    -0.001871     0.003178    -0.064036
std       0.948024     1.017573     1.016963     1.025956
min      -3.700676    -3.290899    -3.451789    -3.134405
25%      -0.581663    -0.667910    -0.675776    -0.756063
50%       0.031722     0.003331     0.012259    -0.063500
75%       0.679740     0.663032     0.695933     0.600186
max       2.873624     3.365925     3.566696     2.857887

In [43]:
col = data_df[2]
# col[np.abs(col) > 3]
data_df[(np.abs(data_df)>3).any(1)]

            0         1         2         3
37   0.432426 -3.290899  1.369047 -0.292040
135 -3.700676  0.096946  0.079427  0.587277
150 -1.420056  3.365925  0.452855  1.171723
190 -3.152875  0.077917  0.857099 -0.138697
248 -1.218078 -0.741070  1.829476 -3.054309
296 -0.760621  0.159760 -3.091460  0.184334
300  0.518026  0.658765 -3.162928 -0.281951
316  0.700082 -1.215525 -3.039519  0.672694
578  0.629890 -1.106279  3.566696  1.222638
750  0.731067  3.249467  1.004904  0.233680
854 -0.598374 -2.054215 -1.265075 -3.134405
911 -0.083628  0.094861 -3.049243 -0.535325
922 -1.115055  2.321085 -3.213377  0.859581
942 -0.047924  0.810729 -3.451789  0.676269

In [44]:
data_df[(np.abs(data_df)>3)] = np.sign(data_df) * 3
# data_df[(np.abs(data_df)>=3).any(1)]
data_df.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.037835    -0.002195     0.003620    -0.063847
std       0.945011     1.014756     1.011999     1.025405
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.581663    -0.667910    -0.675776    -0.756063
50%       0.031722     0.003331     0.012259    -0.063500
75%       0.679740     0.663032     0.695933     0.600186
max       2.873624     3.000000     3.000000     2.857887

In [45]:
# dataa = np.sign(data_df)*3
# dataa.head()

# Permutation and Random Sampling

In [46]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [47]:
sampler = np.random.permutation(5)
print(sampler)

df.take(sampler)

[2 4 0 1 3]

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15

In [48]:
df.sample(5)   # = df.take(np.random.permutation(5))

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15

In [49]:
choices = pd.Series([5, 7, -1, 6, 4])
draw = choices.sample(n=10, replace= True)
draw

0    5
3    6
0    5
3    6
3    6
2   -1
3    6
1    7
1    7
1    7
dtype: int64

# Computing Indicator/Dummy Variables

In [50]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [51]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [52]:
dms = pd.get_dummies(df['key'], prefix='col')
# dms
df_with_dms = df[['data1']].join(dms)
df_with_dms

   data1  col_a  col_b  col_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [53]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('./Data/movielens/movies.dat', sep='::', header=None ,names=mnames)
movies[:10]
# movies.head(10)

C:\Users\zubim\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [54]:
all_genres = []
for i in movies.genres:
    all_genres.extend(i.split('|'))
    
# all_genres
genres = pd.unique(all_genres)
# genres

In [55]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
# dummies
gen = movies.genres[0]
# gen.split('|')

In [56]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [57]:
for i , gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
    
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [58]:
movies_windic = movies.join(dummies.add_prefix('Geners_'))
movies_windic

,movie_id,title,genres,Geners_Animation,Geners_Children's,Geners_Comedy,Geners_Adventure,Geners_Fantasy,Geners_Romance,Geners_Drama,...,Geners_Crime,Geners_Thriller,Geners_Horror,Geners_Sci-Fi,Geners_Documentary,Geners_War,Geners_Musical,Geners_Mystery,Geners_Film-Noir,Geners_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

### get_dummies and cut()

In [59]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [60]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# String Manipulation

## String Object Methods

In [62]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [77]:
pieces = [x.strip() for x in val.split(',')]   #stripe method removes whitespaces
pieces

['a', 'b', 'guido']

In [119]:
# first, second, third = pieces
# first + '::' + second + '::' + third
val2 = '::'.join(pieces)
val2

'a::b::guido'

In [108]:
# 'guido' in val
# val.index(',') # index method raises an error if value index is not found
# val.find(':')  # it does not raises error if index is't found
# val.index('::')
# val2.index(':')
val2.find(':')

1

In [128]:
val.count(',')

2

In [114]:
# val.replace(',', '::')
val.replace(',', '')

'ab guido'

# Regular Expressions

In [20]:
import re

In [79]:
txt = "foo bar\t baz \tqux"
a = re.split('\s', txt)   # split only one occurence
# a = re.split('\s+', txt)   # split on all occurence
a

['foo', 'bar', '', 'baz', '', 'qux']

In [78]:
regex = re.compile('\s+')  # reusable Regular Expression
regex.split(txt)

['foo', 'bar', 'baz', 'qux']

In [92]:
# find all occurence
# re.findall('\s+',txt)
re.match('foo', txt)   # only returns when match is found at the start of string

In [83]:
mails = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
zubair zubimughal99@gmail.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex1 = re.compile(pattern, flags=re.IGNORECASE)
regex1.findall(mails)

['dave@google.com',
 'steve@gmail.com',
 'rob@gmail.com',
 'ryan@yahoo.com',
 'zubimughal99@gmail.com']

In [101]:
m = regex1.search(mails)  # can only return first pattern match in a string
m
# mails[m.start():m.end()]

In [102]:
# substituting exsisted patterns in a string wiht sub method
print(regex1.sub('Matched_pattern', mails))

Dave Matched_pattern
Steve Matched_pattern
Rob Matched_pattern
Ryan Matched_pattern
zubair Matched_pattern

In [122]:
pattern_segs = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
rgx = re.compile(pattern_segs, flags=re.IGNORECASE)
# for a single pattern matched
m = rgx.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [127]:
# for all patterns matched, returns a list of tuple
rgx.findall(mails)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com'),
 ('zubimughal99', 'gmail', 'com')]

In [128]:
print(rgx.sub(r'Username: \1, Domain: \2, Suffix \3', mails))

Dave Username: dave, Domain: google, Suffix com
Steve Username: steve, Domain: gmail, Suffix com
Rob Username: rob, Domain: gmail, Suffix com
Ryan Username: ryan, Domain: yahoo, Suffix com
zubair Username: zubimughal99, Domain: gmail, Suffix com

In [134]:
# re.finditer(pattern_segs, mails)

# Vectorized String Functions in pandas

In [144]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [139]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [145]:
data.str.findall(pattern_segs, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [163]:
matches = data.str.match(pattern_segs, flags=re.IGNORECASE)
matches.get()

TypeError: get() missing 1 required positional argument: 'key'